app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_params(:title,:room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at") VALUES (?, ?, ?)  [["title", "Math 102"], ["room_number", 213], ["created_at", "2022-01-15 23:42:27.387999"]]

    def update
        @school_class= find_class
        @school_class.update(school_params(:title,:room_number))
---
UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "Geomtry 102"], ["id", 5]]

    def find_class
        SchoolClass.find_by_id(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]