app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "James"], ["updated_at", "2022-01-15 23:13:18.102653"], ["id", 1]]
---
    def update
        @student = find_student
        @student.update(student_params(:first_name,:last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_student
        Student.find_by_id(params[:id])